app/Controllers/Pages.php

SELECT *
FROM `tb_employee`
 LIMIT 4
SELECT COUNT(*) AS `numrows`
FROM `tb_employee`
---
    public function employee($id = false)
    {
        if($id == false) {
            $keyword = $this->request->getVar('keyword');
            if($keyword) {
                $db      = \Config\Database::connect();
                $key = $db->escapeString($keyword);
                $query = $db->query("SELECT * FROM tb_employee WHERE employee_name LIKE '%$key%' OR  employee_salary LIKE '%$key%' OR employee_age LIKE '%$key%'");
                $data_employee = $query->getResultArray();
                $pager = false;
            } else {
                $data_employee = $this->EmployeeModel->paginate(4);

SELECT *
FROM `tb_jabatan`
---
    public function insertEmployee()
    {
        $data = [
            'title' => 'INSERT | WebProgrammingUNPAS',
            'data_jabatan' => $this->JabatanModel->findAll(),
            'validation' => \Config\Services::validation()
        ];